#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.logs,
  on s3.tf line 108, in resource "aws_s3_bucket_lifecycle_configuration" "logs":
 108: resource "aws_s3_bucket_lifecycle_configuration" "logs" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_route53_zone.selected: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "004351562122",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "logging.s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "michaelmccarthy.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.michaelmccarthy.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "michaelmccarthy.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.michaelmccarthy.dev",
          + "michaelmccarthy.dev",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudfront_function.append_index will be created
  + resource "aws_cloudfront_function" "append_index" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // Check whether the URI is missing a file name.
              if (uri.endsWith('/')) {
                  request.uri += 'index.html';
              }
              // Check whether the URI is missing a file extension.
              else if (!uri.includes('.')) {
                  request.uri += '/index.html';
              }
            
              return request;
            }
        EOT
      + comment         = "append index.html to requests"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "append-index"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_response_headers_policy.security_headers will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers" {
      + arn     = (known after apply)
      + comment = "Security headers policy for michaelmccarthy.dev"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "michaelmccarthy.dev-security-headers"

      + security_headers_config {
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "strict-origin-when-cross-origin"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_s3_bucket.domain will be created
  + resource "aws_s3_bucket" "domain" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "michaelmccarthy-us-east-1-004351562122-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "michaelmccarthy-logs-us-east-1-004351562122-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-logs"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }
        }
    }

  # aws_s3_bucket_logging.domain will be created
  + resource "aws_s3_bucket_logging" "domain" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "s3/"
    }

  # aws_s3_bucket_ownership_controls.logs will be created
  + resource "aws_s3_bucket_ownership_controls" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_policy.logs will be created
  + resource "aws_s3_bucket_policy" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.domain will be created
  + resource "aws_s3_bucket_public_access_block" "domain" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.logs will be created
  + resource "aws_s3_bucket_public_access_block" "logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"] will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + arn                               = (known after apply)
      + description                       = "cloudfront access to s3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3_oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.logs,
  on s3.tf line 108, in resource "aws_s3_bucket_lifecycle_configuration" "logs":
 108: resource "aws_s3_bucket_lifecycle_configuration" "logs" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and one more similar warning elsewhere)
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*